examples-soap2/src/test/resources/sampleRequests/GetCitiesByCountrySampleRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GetCitiesByCountry xmlns="http://www.webserviceX.NET">
            <CountryName>?</CountryName>
        </GetCitiesByCountry>
    </soap:Body>
</soap:Envelope>